# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [3]:
import numpy as np
import pandas as pd

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [5]:
temp = pd.read_csv(r'C:\Users\Lenovo\Documents\Ironhack\DATA\Temp_States.csv')

#### Print `temp`.

In [6]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [7]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
2 non numeric, 1 float
"""

#### Select the rows where state is New York.

In [8]:
temp.loc[temp['State'] == 'New York']

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [15]:
temp.loc[temp['State'] == 'New York'] ['Temperature'].mean()

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [16]:
temp.loc[temp['Temperature'] > 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [17]:
temp.loc[temp['Temperature'] > 15] ['City']

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [20]:
temp.loc[(temp['Temperature'] > 15) & (temp['Temperature'] <20) ] ['City']

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [23]:
temp['Temperature'].groupby(temp['State']).aggregate(['mean', 'std'])

                  mean       std
State
Connecticut  15.833333  1.964186
New Jersey   21.111111  1.571348
New York     10.740741  8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [28]:
employees = pd.read_csv(r'C:\Users\Lenovo\Documents\Ironhack\DATA\employees.csv')
employees

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
3        Admin    Master         VP  Manuella     15      33
4        Sales    Master    Analyst     Carla      6      38
..         ...       ...        ...       ...    ...     ...
495      Sales       PhD         VP    Calvin      2     119
496         HR    Master    Analyst    Dustin      6      67
497      Sales       PhD         VP   Winston     13      93
498         IT       PhD    Analyst      Earl     12     108
499      Sales    Master    Analyst     Alvin     13      48

[500 rows x 6 columns]

#### Explore the data types of the `employees` dataframe. Comment your results.

In [27]:
employees.dtypes

Department    object
Education     object
Title         object
Name          object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
4 non-numeric et 2 integer
"""

#### What's the average salary in this company?

In [29]:
employees ['Salary'].mean()

73.528

#### What's the highest salary?

In [30]:
employees ['Salary'].max()

120

#### What's the lowest salary?

In [31]:
employees ['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [37]:
employees[employees ['Salary'] == employees ['Salary'].min()] ['Name']

27         Sean
106        Luke
128        Adam
139        Rick
214        Neil
266      Marcel
452    Augustin
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [39]:
employees[employees ['Name'] == 'David']

    Department Education      Title   Name  Years  Salary
0        Admin    Master  associate  David      4      58
124         IT  Bachelor         VP  David      3      31

#### Could you return only David's salary?

In [40]:
employees[employees ['Name'] == 'David'] ['Salary']

0      58
124    31
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [41]:
employees[employees ['Title'] == 'associate']

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
7           HR    Master  associate     Carol     14      53
8        Admin       PhD  associate      Jean      8      50
..         ...       ...        ...       ...    ...     ...
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
491      Admin       PhD  associate     Alice      8      37
494      Sales  Bachelor  associate   Vanessa     11     118

[158 rows x 6 columns]

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [44]:
employees.head(3)

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

In [45]:
employees[0:2]

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45

#### Find the employees whose title is associate and whose salary is above 55.

In [46]:
employees[(employees['Title']=='associate') & (employees['Salary'] > 55)]

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
9        Admin    Master  associate    Kareem      3     104
10       Admin    Master  associate   Cynthia      1     114
16       Admin  Bachelor  associate    Shanon      1      99
18       Admin  Bachelor  associate     Megan      9      79
..         ...       ...        ...       ...    ...     ...
476      Admin       PhD  associate      Greg      8      93
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
494      Sales  Bachelor  associate   Vanessa     11     118

[104 rows x 6 columns]

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [48]:
employees['Salary'].groupby(employees['Years']).aggregate(['mean'])

            mean
Years
1      75.863636
2      75.857143
3      74.571429
4      77.129032
5      73.857143
6      72.382353
7      73.840000
8      64.250000
9      76.741935
10     73.351351
11     74.866667
12     73.454545
13     71.935484
14     70.968750
15     69.758621

####  What is the average salary per title?

In [49]:
employees['Salary'].groupby(employees['Title']).aggregate(['mean'])

                mean
Title
Analyst    73.703911
VP         72.907975
associate  73.968354

####  Find the salary quartiles.

In [50]:
employees['Salary'].quantile([0.25,0.5,0.75])

0.25    50.0
0.50    72.0
0.75    97.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [ ]:
# your code here

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [51]:
employees.groupby(employees['Department']).aggregate(['min','mean', 'max'])

           Years               Salary
             min      mean max    min       mean  max
Department
Admin          1  7.642276  15     30  76.325203  120
HR             1  7.172131  15     30  74.237705  119
IT             1  8.141791  15     30  70.671642  120
Sales          1  7.206612  15     30  73.132231  120

 Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [57]:
employees.groupby(employees['Department']).apply(lambda x: x['Salary'].max()-x['Salary'].min())

Department
Admin    90
HR       89
IT       90
Sales    90
dtype: int64

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here